## Plan Result (860: stg_rbac - TerraformPlanApply)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 0 to change, 12 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Admin Login (env:staging)-crime-portal-frontend-vm01-stg&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Admin Login (env:staging)-crime-portal-frontend-vm02-stg&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Login (env:staging)-crime-portal-frontend-vm01-stg&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Login (env:staging)-crime-portal-frontend-vm02-stg&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Platform Operations-crime-portal-frontend-vm01-stg&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Platform Operations-crime-portal-frontend-vm02-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Admin Login (env:staging)-crime-portal-ldap-vm01-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Admin Login (env:staging)-crime-portal-ldap-vm02-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Login (env:staging)-crime-portal-ldap-vm01-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Login (env:staging)-crime-portal-ldap-vm02-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Platform Operations-crime-portal-ldap-vm01-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Platform Operations-crime-portal-ldap-vm02-stg&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Admin Login (env:staging)-crime-portal-frontend-vm01-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-stg/providers/Microsoft.Authorization/roleAssignments/9443dffa-e48a-7ccc-b8d5-70ad70724b3f" -> (known after apply)
      ~ name                                   = "9443dffa-e48a-7ccc-b8d5-70ad70724b3f" -> (known after apply)
      ~ principal_id                           = "fcae01c5-38ff-4f41-9c26-9d327fb286df" -> "/groups/fcae01c5-38ff-4f41-9c26-9d327fb286df" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Admin Login (env:staging)-crime-portal-frontend-vm02-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-stg/providers/Microsoft.Authorization/roleAssignments/b7845865-f19a-84c1-9c8d-5ae68ba87753" -> (known after apply)
      ~ name                                   = "b7845865-f19a-84c1-9c8d-5ae68ba87753" -> (known after apply)
      ~ principal_id                           = "fcae01c5-38ff-4f41-9c26-9d327fb286df" -> "/groups/fcae01c5-38ff-4f41-9c26-9d327fb286df" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Login (env:staging)-crime-portal-frontend-vm01-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-stg/providers/Microsoft.Authorization/roleAssignments/223bb9ea-6671-b4de-0eb5-fa315b64040d" -> (known after apply)
      ~ name                                   = "223bb9ea-6671-b4de-0eb5-fa315b64040d" -> (known after apply)
      ~ principal_id                           = "1c605be7-8630-471b-bdd5-e0e7df2b488c" -> "/groups/1c605be7-8630-471b-bdd5-e0e7df2b488c" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Login (env:staging)-crime-portal-frontend-vm02-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-stg/providers/Microsoft.Authorization/roleAssignments/20ade1bc-d25b-6a84-4db3-e91a01d55364" -> (known after apply)
      ~ name                                   = "20ade1bc-d25b-6a84-4db3-e91a01d55364" -> (known after apply)
      ~ principal_id                           = "1c605be7-8630-471b-bdd5-e0e7df2b488c" -> "/groups/1c605be7-8630-471b-bdd5-e0e7df2b488c" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Platform Operations-crime-portal-frontend-vm01-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-stg/providers/Microsoft.Authorization/roleAssignments/ba226d5b-23ca-a3db-6975-76dd0ae88c7e" -> (known after apply)
      ~ name                                   = "ba226d5b-23ca-a3db-6975-76dd0ae88c7e" -> (known after apply)
      ~ principal_id                           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> "/groups/e7ea2042-4ced-45dd-8ae3-e051c6551789" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Platform Operations-crime-portal-frontend-vm02-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-stg/providers/Microsoft.Authorization/roleAssignments/27101509-07e1-6855-69a4-b9cad92b15a4" -> (known after apply)
      ~ name                                   = "27101509-07e1-6855-69a4-b9cad92b15a4" -> (known after apply)
      ~ principal_id                           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> "/groups/e7ea2042-4ced-45dd-8ae3-e051c6551789" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Admin Login (env:staging)-crime-portal-ldap-vm01-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-stg/providers/Microsoft.Authorization/roleAssignments/2d2f4701-739f-6505-7013-72b634e54dc7" -> (known after apply)
      ~ name                                   = "2d2f4701-739f-6505-7013-72b634e54dc7" -> (known after apply)
      ~ principal_id                           = "fcae01c5-38ff-4f41-9c26-9d327fb286df" -> "/groups/fcae01c5-38ff-4f41-9c26-9d327fb286df" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Admin Login (env:staging)-crime-portal-ldap-vm02-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-stg/providers/Microsoft.Authorization/roleAssignments/ad5ac923-1081-4eee-f36c-065e1742cf80" -> (known after apply)
      ~ name                                   = "ad5ac923-1081-4eee-f36c-065e1742cf80" -> (known after apply)
      ~ principal_id                           = "fcae01c5-38ff-4f41-9c26-9d327fb286df" -> "/groups/fcae01c5-38ff-4f41-9c26-9d327fb286df" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Login (env:staging)-crime-portal-ldap-vm01-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-stg/providers/Microsoft.Authorization/roleAssignments/80242e23-fd1f-e711-77ce-9686eaa72afc" -> (known after apply)
      ~ name                                   = "80242e23-fd1f-e711-77ce-9686eaa72afc" -> (known after apply)
      ~ principal_id                           = "1c605be7-8630-471b-bdd5-e0e7df2b488c" -> "/groups/1c605be7-8630-471b-bdd5-e0e7df2b488c" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Login (env:staging)-crime-portal-ldap-vm02-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-stg/providers/Microsoft.Authorization/roleAssignments/e41fe3b2-e9c0-aa29-56f4-a73d99e4f2ff" -> (known after apply)
      ~ name                                   = "e41fe3b2-e9c0-aa29-56f4-a73d99e4f2ff" -> (known after apply)
      ~ principal_id                           = "1c605be7-8630-471b-bdd5-e0e7df2b488c" -> "/groups/1c605be7-8630-471b-bdd5-e0e7df2b488c" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Platform Operations-crime-portal-ldap-vm01-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-stg/providers/Microsoft.Authorization/roleAssignments/fdc3868d-f15f-aec1-29e1-82188b455c8d" -> (known after apply)
      ~ name                                   = "fdc3868d-f15f-aec1-29e1-82188b455c8d" -> (known after apply)
      ~ principal_id                           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> "/groups/e7ea2042-4ced-45dd-8ae3-e051c6551789" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Platform Operations-crime-portal-ldap-vm02-stg"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-stg/providers/Microsoft.Authorization/roleAssignments/b7a9be5e-ee25-a105-c941-556261f321b9" -> (known after apply)
      ~ name                                   = "b7a9be5e-ee25-a105-c941-556261f321b9" -> (known after apply)
      ~ principal_id                           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> "/groups/e7ea2042-4ced-45dd-8ae3-e051c6551789" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 12 to add, 0 to change, 12 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":78,"Program":"tfcmt","SHA1":"","Target":"860: stg_rbac - TerraformPlanApply","Vars":{}} -->